# Nurbs Surface Data Get Knot V Method

Source: https://www.revitapidocs.com/2026/6f0ee09b-1506-2b16-3679-bc363c09bc5e.htm

---

| Nurbs Surface Data Get Knot V Method |
| --- |

Get the knot in the v\-direction.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public double GetKnotV(
	int idx
)
```

```
Public Function GetKnotV (
	idx As Integer
) As Double
```

```
public:
double GetKnotV(
	int idx
)
```

```
member GetKnotV :
        idx : int -> float
```

#### Parameters

idx Int32
:   The index of the knot.

#### Return Value

Double Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | Out\-of\-range access. |

See Also

#### Reference

NurbsSurfaceData Class Autodesk.Revit.DB Namespace